Статистика работы механизмов/Конфигурация/DataProcessors/_РассылкаРасхожденийСЧАиЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_РассылкаРасхожденийСЧАиЕПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_РассылкаРасхожденийСЧАиЕПС/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка", "Рассылка расхождений СЧА и ЕПС", "0.02", "", Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОтправитьОтчет", "Отправить отчет",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции //СведенияОВнешнейОбработке

// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЭтотОбъект.Организация         = ПараметрыКоманды.Организация; 	
	ЭтотОбъект.ПолучателиСообщений = ПараметрыКоманды.ПолучателиСообщений;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
		
	Если Найти(ИдентификаторКоманды, "ОтправитьОтчет") = 1 И ЗначениеЗаполнено(ЭтотОбъект.Организация) И ЗначениеЗаполнено(ЭтотОбъект.ПолучателиСообщений) Тогда
	
		МассивДат = ПолучитьДатыФормированияОтчета(); 
	
		Если МассивДат = Неопределено Тогда
			Возврат;
		Иначе
			
			Для Каждого ДатаОтчета Из МассивДат Цикл
				
				ЭтотОбъект.ДатаОтчета = ДатаОтчета;
				
				Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОтчета) Тогда
					СформироватьИОтправитьОтчет();	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	ОповеститьОбОшибках(Неопределено);
	
КонецПроцедуры //ВыполнитьКоманду

Процедура СформироватьИОтправитьОтчет() Экспорт
	
	Если Не ЭтотОбъект.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
#Область НАЧАЛО_СЕССИИ	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
	
	ПараметрыОтчета = Новый Структура("Организация, ДатаОтчета, ПолучателиСообщений");
	ПараметрыОтчета.Организация         = ЭтотОбъект.Организация;
	ПараметрыОтчета.ДатаОтчета          = ЭтотОбъект.ДатаОтчета;
	ПараметрыОтчета.ПолучателиСообщений = ЭтотОбъект.ПолучателиСообщений;
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	Описание  = "Организация: " + ЭтотОбъект.Организация + Символы.ПС + "ДатаОтчета: " + ЭтотОбъект.ДатаОтчета + Символы.ПС + "ПолучателиСообщений: " + ЭтотОбъект.ПолучателиСообщений;	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
#КонецОбласти

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления.Наименование КАК СчетДоверительногоУправленияНаименование,
		|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ _ЕПС
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&КонецДняГраница,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеПоСправедливой), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолевыеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеДляПродажиИДоПогашения), ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами), ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСчетаПоОперациямСПриобретеннымиЦеннымиБумагами), ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПрочиеСредства), ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02), ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03), ЗНАЧЕНИЕ(ПланСчетов.Единый.УчастиеВДочернихОбществахИПаевыхФондах), ЗНАЧЕНИЕ(ПланСчетов.Единый.СчетаДляКлиринга), ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроизводныеФинансовыеИнструменты)),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления В (&ВидыДоговоровДУ)
		|				И (НЕ ЛицевойСчет.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ03), ЗНАЧЕНИЕ(ПланСчетов.Единый.АктивыВДУ02))
		|					ИЛИ ЛицевойСчет.ДополнительнаяАналитика = ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ВознаграждениеУправляющего))) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Значение КАК Сумма,
		|	ФинансовыеПоказатели.СубъектАналитики.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ВЫРАЗИТЬ(ФинансовыеПоказатели.СубъектАналитики КАК Справочник.СчетаДоверительногоУправления).ВидДоговораДоверительногоУправления В (&ВидыДоговоровДУ)
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	И ФинансовыеПоказатели.Период = &НачалоДня
		|	И ФинансовыеПоказатели.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЕПС.СчетДоверительногоУправленияНаименование КАК СчетДоверительногоУправленияНаименование,
		|	_ЕПС.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СЧА.Сумма КАК СуммаСЧА,
		|	_ЕПС.Сумма КАК СуммаЕПС,
		|	_ЕПС.Сумма - _СЧА.Сумма КАК Расхождение
		|ИЗ
		|	_СЧА КАК _СЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЕПС КАК _ЕПС
		|		ПО _СЧА.СчетДоверительногоУправления = _ЕПС.СчетДоверительногоУправления
		|ГДЕ
		|	_ЕПС.Сумма <> _СЧА.Сумма
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправленияНаименование";
	
	Запрос.УстановитьПараметр("Организация"    , ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоДня"      , ЭтотОбъект.ДатаОтчета);
	Запрос.УстановитьПараметр("КонецДняГраница", Новый Граница(КонецДня(ЭтотОбъект.ДатаОтчета), ВидГраницы.Включая));
	
	ВидыДоговоровДУ = Новый Массив;
	ВидыДоговоровДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
	ВидыДоговоровДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
	ВидыДоговоровДУ.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов);
	
	Запрос.УстановитьПараметр("ВидыДоговоровДУ", ВидыДоговоровДУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстПисьма = "";
	Пока Выборка.Следующий() Цикл
		
		ТекстПисьма = ТекстПисьма + 
			"<tr class=""account"">
			|	<td colspan=""3"", align = ""left"">" + Выборка.СчетДоверительногоУправления + "</td>
			|</tr>";
		
		ТекстПисьма = ТекстПисьма + 
			"<tr>
			|	<td>" + Выборка.СуммаЕПС + "</td>
			|	<td>" + Выборка.СуммаСЧА + "</td>
			|	<td class=""mistake"">" + СтрЗаменить(Формат(Выборка.Расхождение, "ЧО=1"), "-", "") + "</td>        
			|</tr>";

		
	КонецЦикла;
	
	Если ТекстПисьма <> "" Тогда
		
		ТекстПисьма =
			"<html>
			|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
			|	<style>
			|		body {
			|			font: 10pt sans-serif;
			|		}
			|		table {
			|			text-align: center;
			|			border-spacing: 0;
			|			border-collapse: collapse;
			|		}
			|		td {
			|			font-size: 1em;
			|			border: 1px solid black;
			|			padding: 5px 20px 5px 20px;
			|		}
			|		.account {
			|			background: lightgrey;
			|			color: black;
			|			font-size: 14px;
			|		}
			|		.top {
			|			color: black;
			|			font-size: 15px;
			|			background: lightgrey;
			|		}
			|		.mistake {
			|			color: red;
			|		}
			|	</style>
			|</head>
			|<body>
			|Расхождения при сверке данных за период " + Формат(ЭтотОбъект.ДатаОтчета, "ДЛФ=Д") + "
			|<table cols=""3""> 
			|<tr class=""top"">
			|<td>Сумма ЕПС</td>
			|<td>Сумма СЧА</td>
			|<td>Расхождение</td>
			|</tr>"
			+ ТекстПисьма + "</table></body></html>";
			
	КонецЕсли;

	Если ТекстПисьма <> "" Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ПолучателиСообщений) Тогда
	
		    ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста");
			
			ПараметрыПисьма.Кому      = ЭтотОбъект.ПолучателиСообщений;
			ПараметрыПисьма.Тема      = "Отчет сверки СЧА с данными бухгалтерского учета.";
			ПараметрыПисьма.Тело      = ТекстПисьма;		
			ПараметрыПисьма.ТипТекста = "HTML";
			
			РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
			
		КонецЕсли;
		
		ЭтотОбъект.Отчет = ТекстПисьма;
		
	КонецЕсли;

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры //СформироватьИОтправитьОтчет

Функция ПолучитьДатыФормированияОтчета()
	
	//Отчет формируется по рабочим дням на Т-2. Также отчет нужно формировать и на последний день месяца(независимо от того, рабочий это или выходной день).
	//функция может вернуть несколько дат.
	//Если последний день месяца выпал на выходные - во вторник фунция вернет две даты Т-2 (предыдущую пятницу, и последний день месяца, который выпал на выходные).

	ДатаВыполненияРегламентногоЗадания = НачалоДня(ТекущаяДатаСеанса());
	
	Если Не Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ДатаВыполненияРегламентногоЗадания) Тогда
		Возврат Неопределено;	
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ДанныеКалендаря.ВидДня КАК ВидДня
		|ПОМЕСТИТЬ _ДатыФормированияОтчета
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	(ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|			ИЛИ ДанныеКалендаря.Дата = НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ), ДЕНЬ))
		|	И РАЗНОСТЬДАТ(ДанныеКалендаря.Дата, &ДатаВыполненияРегламентногоЗадания, ДЕНЬ) МЕЖДУ 0 И 15
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_ДатыФормированияОтчета.Дата) КАК Дата
		|ПОМЕСТИТЬ _МинусОдинРабочийДень
		|ИЗ
		|	_ДатыФормированияОтчета КАК _ДатыФормированияОтчета
		|ГДЕ
		|	_ДатыФормированияОтчета.Дата < &ДатаВыполненияРегламентногоЗадания
		|	И _ДатыФормированияОтчета.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(_ДатыФормированияОтчета.Дата) КАК ДатаОтчета
		|ИЗ
		|	_МинусОдинРабочийДень КАК _МинусОдинРабочийДень
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыФормированияОтчета КАК _ДатыФормированияОтчета
		|		ПО _МинусОдинРабочийДень.Дата > _ДатыФормированияОтчета.Дата
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(_ДатыФормированияОтчета.Дата)
		|ИЗ
		|	_МинусОдинРабочийДень КАК _МинусОдинРабочийДень
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыФормированияОтчета КАК _ДатыФормированияОтчета
		|		ПО _МинусОдинРабочийДень.Дата > _ДатыФормированияОтчета.Дата
		|			И (_ДатыФормированияОтчета.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))";
	
	Запрос.УстановитьПараметр("ДатаВыполненияРегламентногоЗадания", ДатаВыполненияРегламентногоЗадания);
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДатаОтчета");
	
КонецФункции //ПолучитьДатыФормированияОтчета

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	
	Если МассивСообщений.Количество() > 0 Тогда

		ТекстОшибки = ТекстОшибки + Символы.ПС + "Сообщения пользователю:";
		
		Для Каждого ТекСообщение Из МассивСообщений Цикл
			
			Если ТекСообщение.Текст = "" Тогда
				Продолжить;
			Иначе
				Текст = ТекСообщение.Текст + ". " + Строка(ТекСообщение.КлючДанных);
				ТекстОшибки = ТекстОшибки + Символы.ПС + Текст; 
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ТекстОшибки = ТекстОшибки;                                  
	КонецЕсли;
	
    Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки) = Неопределено Тогда    	
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры //ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки)Экспорт
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
		КонецЕсли;
		
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");	
	
КонецПроцедуры //ОповеститьОбОшибках

ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
